---
kind: property
id: P:Autodesk.Revit.DB.DisciplineTypeId.Infrastructure
source: html/8033bdb0-f0b7-7bfb-22ba-a6225245c27b.htm
---
# Autodesk.Revit.DB.DisciplineTypeId.Infrastructure Property

Infrastructure.

## Syntax (C#)
```csharp
public static ForgeTypeId Infrastructure { get; }
```